Revit 2026 API

# EdgeApproximateLength Property

---

Returns the approximate length of the edge.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ApproximateLength { get; }
```
```vb
Public ReadOnly Property ApproximateLength As Double
	Get
```
```cpp
public:
property double ApproximateLength {
	double get ();
}
```
```fsharp
member ApproximateLength : float with get
```

#### Property Value

Double

Estimates the length of the edge by adding together tessellated segments, Will underestimate when the surface is curved.

#### Reference

Edge Class

Autodesk.Revit.DB Namespace